### Forest: Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
newrelic_alert_policy.alert: Refreshing state... [id=1293124]
newrelic_notification_channel.slack-channel[0]: Refreshing state... [id=78880005-d93a-46d3-ad94-bd0dba9c2366]
newrelic_synthetics_script_monitor.snapshot-age-monitor: Refreshing state... [id=Mzk0MjU3NXxTWU5USHxNT05JVE9SfGViMDdlNGRjLTJiNTctNDZlZi05M2E4LTg3NTRmNDYyMjNiOA]
newrelic_workflow.alerting-workflow-slack[0]: Refreshing state... [id=c25a31db-8f8f-46dd-85d1-d2fe4b626fda]
newrelic_nrql_alert_condition.failing-snapshot-age: Refreshing state... [id=1293124:5596267]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_notification_channel.pagerduty-channel[0] will be created
  + resource "newrelic_notification_channel" "pagerduty-channel" {
      + account_id     = (known after apply)
      + active         = true
      + destination_id = (sensitive value)
      + id             = (known after apply)
      + name           = "prod-snapshot-age-monitor pagerduty"
      + product        = "IINT"
      + status         = (known after apply)
      + type           = "PAGERDUTY_SERVICE_INTEGRATION"

      + property {
          + key   = "customDetails"
          + value = <<-EOT
                {
                "id":{{json issueId}},
                "IssueURL":{{json issuePageUrl}},
                "NewRelic priority":{{json priority}},
                "Total Incidents":{{json totalIncidents}},
                "Impacted Entities":"{{#each entitiesData.names}}{{this}}{{#unless @last}}, {{/unless}}{{/each}}",
                "Runbook":"{{#each accumulations.runbookUrl}}{{this}}{{#unless @last}}, {{/unless}}{{/each}}",
                "Description":"{{#each annotations.description}}{{this}}{{#unless @last}}, {{/unless}}{{/each}}",
                "isCorrelated":{{json isCorrelated}},
                "Alert Policy Names":"{{#each accumulations.policyName}}{{this}}{{#unless @last}}, {{/unless}}{{/each}}",
                "Alert Condition Names":"{{#each accumulations.conditionName}}{{this}}{{#unless @last}}, {{/unless}}{{/each}}",
                "Workflow Name":{{json workflowName}}
                }
            EOT
        }
      + property {
          + key   = "summary"
          + value = "Filecoin Forest snapshot age monitor {{#isCritical}}CRITICAL{{/isCritical}}{{#isWarning}}WARNING{{/isWarning}}"
        }
    }

  # newrelic_workflow.alerting-workflow-pagerduty[0] will be created
  + resource "newrelic_workflow" "alerting-workflow-pagerduty" {
      + account_id            = (known after apply)
      + destinations_enabled  = true
      + enabled               = true
      + enrichments_enabled   = true
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + last_run              = (known after apply)
      + muting_rules_handling = "NOTIFY_ALL_ISSUES"
      + name                  = "prod-snapshot-age-monitor pagerduty alerting workflow"
      + workflow_id           = (known after apply)

      + destination {
          + channel_id            = (known after apply)
          + name                  = (known after apply)
          + notification_triggers = (known after apply)
          + type                  = (known after apply)
        }

      + issues_filter {
          + filter_id = (known after apply)
          + name      = "prod-snapshot-age-monitor alerting workflow filter"
          + type      = "FILTER"

          + predicate {
              + attribute = "labels.policyIds"
              + operator  = "EXACTLY_MATCHES"
              + values    = [
                  + "1293124",
                ]
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/forest-iac/forest-iac/tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/forest-iac/forest-iac/tfplan"
```

</details>